{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "function_type": "lambda", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "Normalization", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape": null, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "b_constraint": null, "nb_filter": 24, "subsample": [2, 2], "border_mode": "same", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_1", "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "b_constraint": null, "nb_filter": 36, "subsample": [2, 2], "border_mode": "same", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_2", "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "b_regularizer": null, "b_constraint": null, "nb_filter": 48, "subsample": [2, 2], "border_mode": "same", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "name": "convolution2d_3", "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "subsample": [2, 2], "border_mode": "same", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_4", "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "subsample": [2, 2], "border_mode": "same", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "name": "convolution2d_5", "activation": "elu", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 3200, "W_regularizer": null, "bias": true, "name": "dense_1", "activation": "elu", "init": "glorot_uniform", "output_dim": 100}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 100, "W_regularizer": null, "bias": true, "name": "dense_2", "activation": "elu", "init": "glorot_uniform", "output_dim": 50}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 50, "W_regularizer": null, "bias": true, "name": "dense_3", "activation": "elu", "init": "glorot_uniform", "output_dim": 10}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 10, "W_regularizer": null, "bias": true, "name": "dense_4", "activation": "elu", "init": "glorot_uniform", "output_dim": 1}}]}